<?php
// 【演算子】
// 算術演算子
// Q. 算術演算子を利用し、出力結果が以下のようなコードを記述しましょう。
// 18
// 12
// 45
// 5
// 5
$a = 15;
$b = 3;
$c = 10;

$answer1 = $a + $b;
$answer2 = $a - $b;
$answer3 = $a * $b;
$answer4 = $a / $b;
$answer5 = $a % $c;

echo $answer1 . "<br>";
echo $answer2 . "<br>";
echo $answer3 . "<br>";
echo $answer4 . "<br>";
echo $answer5 . "<br>";


// 代入演算子
// Q. 複合演算子利用し、出力結果が以下のようなコードを記述しましょう。
// 3
// 15
$a = 15;
$b = 3;
$c = 10;
$d = 5;

$a = $b;
$c += $d;

echo $a . "<br>";
echo $c . "<br>";


// 比較演算子
// Q. 変数$aと$bを定義して下記の問題に答えてください。
// $aが$bよりも大きいことが正しいか、比較演算子を用いて検証してみましょう。（正しいときは1が返ってきます。）
$a = 20;
$b = 5;

echo $a > $b;
echo "<br>";


// 論理演算子
// Q. 変数$aと$bを定義して下記の問題に答えてください。
// 比較演算子と論理演算子を用いて$aが10より大きいかつ30より小さいことが正しいかechoを用いて出力してください。（正しいときは1が返ってきます。）
$a = 20;
$b = 5;

echo ($a > 10 && $a < 30);
echo "<br>";


// 加算子と減算子
// Q. 加算子と減算子を利用し、出力結果が以下のようなコードを記述しましょう。
// 11
// 10
// 4
// 5
$a = 10;
$b = 10;
$c = 5;
$d = 5;

echo ++$a;
echo "<br>";
echo $b++;
echo "<br>";
echo --$c;
echo "<br>";
echo $d--;